duattn1/STM32F407_PeripheralLibrary/Projects/Flash_Progamming_Utility_On_PC/src/main.c
#include <Windows.h>
#include <stdio.h>
#include <stdint.h>
#include "serial_port_communication.h"
#include "stm32f4discovery_bootloader_commands.h"
#include "hex_parser.h"


void printCMDMenu(void);

void programFlash(void);

/*checksum = sum[all hex, exclude the checksum itself] % 256 (dec), then got the Two's complement of the result */
char hexBinary[] = 
":020000040800F2\
:1000000068060020290200083102000833020008B7\
:10001000350200083702000839020008000000001D\
:100020000000000000000000000000003B0200088B\
:100030003D020008000000003F02000855040008CF\
:10004000430200084302000843020008430200087C\
:10005000430200084302000843020008430200086C\
:10006000430200084302000843020008430200085C\
:10007000430200084302000843020008430200084C\
:10008000430200084302000843020008430200083C\
:10009000430200084302000843020008430200082C\
:1000A000430200084302000843020008430200081C\
:1000B000430200084302000843020008430200080C\
:1000C00043020008430200084302000843020008FC\
:1000D00043020008430200084302000843020008EC\
:1000E00043020008430200084302000843020008DC\
:1000F00043020008430200084302000843020008CC\
:1001000043020008430200084302000843020008BB\
:1001100043020008430200084302000843020008AB\
:10012000430200084302000843020008430200089B\
:10013000430200084302000843020008430200088B\
:10014000430200084302000843020008430200087B\
:10015000430200084302000843020008430200086B\
:10016000430200084302000843020008430200085B\
:100170004302000843020008430200080000000098\
:10018000430200084302000800F002F800F03CF8C7\
:100190000AA090E8000C82448344AAF10107DA45E2\
:1001A00001D100F031F8AFF2090EBAE80F0013F0F8\
:1001B000010F18BFFB1A43F001031847D4030000D6\
:1001C000F4030000103A24BF78C878C1FAD8520767\
:1001D00024BF30C830C144BF04680C6070470000C1\
:1001E0000023002400250026103A28BF78C1FBD840\
:1001F000520728BF30C148BF0B6070471FB500F0E1\
:10020000C1F91FBD10B510BD00F031F81146FFF760\
:10021000F5FF00F069F900F04FF803B4FFF7F2FFC3\
:1002200003BC00F057F80000094880470948004720\
:10023000FEE7FEE7FEE7FEE7FEE7FEE7FEE7FEE796\
:10024000FEE7FEE704480549054A064B70470000F3\
:100250006D0400088901000868000020680600207D\
:10026000680200206802002070477047704775469A\
:1002700000F02CF8AE4605006946534620F0070012\
:10028000854618B020B5FFF7DDFFBDE820404FF0F0\
:1002900000064FF000074FF000084FF0000B21F070\
:1002A0000701AC46ACE8C009ACE8C009ACE8C0093D\
:1002B000ACE8C0098D46704710B50446AFF3008026\
:1002C0002046BDE81040FFF7A8BF00000048704777\
:1002D0000800002001491820ABBEFEE726000200FE\
:1002E000704700002DE9F041DDE90656089C4C4FAF\
:1002F000B84208D14B4F3F6847F00107DFF824C1EF\
:10030000CCF8007022E0484FB84208D1454F3F6812\
:1003100047F00207DFF80CC1CCF8007016E0434F3D\
:10032000B84208D13F4F3F6847F00407DFF8F4C0F8\
:10033000CCF800700AE03E4FB84207D1394F3F6811\
:1003400047F00807DFF8DCC0CCF8007007684FEA18\
:1003500041084FF0030C0CFA08FC27EA0C07076071\
:1003600007684FEA410C02FA0CFC47EA0C070760E9\
:10037000476803FA01FC47EA0C07476087684FEAC1\
:1003800041084FF0030C0CFA08FC27EA0C078760C1\
:1003900087684FEA410C05FA0CFC47EA0C078760B6\
:1003A000C7684FEA41084FF0030C0CFA08FC27EA33\
:1003B0000C07C760C7684FEA410C06FA0CFC47EA15\
:1003C0000C07C760082912DA076A4FEA81084FF064\
:1003D0000F0C0CFA08FC27EA0C070762076A4FEAC1\
:1003E000810C04FA0CFC47EA0C07076215E0476A27\
:1003F0004FEA810CACF1200C4FF00F0808FA0CF812\
:1004000027EA08074762476A4FEA810CACF1200CE3\
:1004100004FA0CFC47EA0C074762BDE8F0810000D3\
:100420000000024030380240000402400008024050\
:10043000000C024010B5826901F1100301249C40B8\
:100440002243826110BD826901238B401A4382617D\
:10045000704700000448006820B103480068401E4F\
:10046000014908607047000000000020144800683F\
:1004700040F47000124908601248006840F0010022\
:100480001049086000200F49083108600D480068D5\
:100490000D4908400B4908600C48091D0860081FF9\
:1004A000006820F48020091F0860002005490C31F5\
:1004B00008604FF000600249803908607047000012\
:1004C00088ED00E000380240FFFFF6FE1030002407\
:1004D00001B504490098086000BF02480068002880\
:1004E000FBD108BD000000200EB500200322CDE99D\
:1004F0000020034601220E2102901E48FFF7F2FE63\
:100500001D4800684FF47A72B0FBF2F1481EB0F15A\
:10051000807F00D31BE0481E4FF0E022506150174F\
:100520000F22002804DB13071C0E144B1C5406E09A\
:1005300013071D0E124B00F00F04241F1D5500BFA2\
:1005400000204FF0E02290610720106100BF0FE013\
:100550000E210848FFF777FF4FF47A70FFF7B8FFD6\
:100560000E210448FFF766FF4FF47A70FFF7B0FFE3\
:10057000EEE70000000C02400400002000E400E070\
:1005800018ED00E04FF04070E1EE100A70470000F7\
:10059000B00500080000002008000000C4010008A9\
:1005A000B80500080800002060060000E00100080F\
:0805B000000000000024F4002B";
	
void main(void){
	uint8_t bootloaderConnected;
	char bBuffer[] = {0x7F};
	
	serialPortInit();	

	Sleep(1000);
	bootloaderConnected = startBootloader();
	if(!bootloaderConnected){
		printf("Please check your serial port connection and restart the application\n");
	} else {
		while(1){
			int selectedCMD = 0;
			printCMDMenu();
			scanf("%d", &selectedCMD);
			switch(selectedCMD){
				case 0: return;
				case 1: getBootloaderVersion(); break;
				case 2: readMemory(); break;
				case 3: eraseMemory(16); break;
				
				case 4: programFlash(); break;
				default: printf("Select again!\n");
			}
		}	
	}		
	
	CloseHandle(hComm); /*Closing the Serial Port*/
	
	/*programFlash();*/
	

	_getch();
} 
	
void printCMDMenu(void){
	printf("\nSELECT COMMAND\n");
	printf("1. Get bootloader version\n");
	printf("2. Read memory\n");
	printf("3. Erase memory\n");
	printf("4. Program Flash with hex file\n");
	printf("---------------------------\n");
	printf("0. Quit\n");
}	


void programFlash(void){
	int readIndex = 0;    
    uint16_t baseAddress = 0;
    
	while(readIndex < sizeof(hexBinary)){
		while(hexBinary[readIndex] != ':' && readIndex < sizeof(hexBinary)){
   			readIndex++;
  		}
  		printf("----------\n");
  		if(hexBinary[readIndex] == ':'){
  			hexRecord xx;  			
  			xx = readHexRecord(hexBinary, readIndex);
  			if(xx.type == 4){
  				baseAddress |= xx.data[0] << 8;	
				baseAddress |= xx.data[1] ;		
			} else if (xx.type == 0){
				printf("------address: %08x-------\n", xx.address + 0x08000000);
  				writeMemory(xx);
			} /* Not process the other type of record yet*/
  			
  			/*
  			printf(":%02x ", xx.length);
			printf("%04x ", xx.address);
			printf("%02x ", xx.type);   
			for(j = 0; j < xx.length ;j++){
				printf("%02x", xx.data[j]);
			}   
			printf(" %02x\n", xx.checksum);
			*/
		}	
		
		
		readIndex++;	
	}
}
		

